tutorials/RFGTumble2D/combiRun/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    master
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    slave
    {
        type            cyclicAMI;
        value           uniform 0;
    }

    // Top = OUTLET: fixed pressure reference
    top
    {
        type            fixedValue;
        value           uniform 0;
    }

    // Bottom = INLET: zero gradient (velocity is prescribed)
    bottom
    {
        type            zeroGradient;
    }

    // Side walls: zero gradient
    sideWalls
    {
        type            zeroGradient;
    }

    rod
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
