tutorials/RFGTumble2D/combiRun/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     freeFallingPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         45;       // 0.5 s → ball has fallen ~1.2 m, speed ~5 m/s

deltaT          0.005;      // initial time step; adjusted by adjustTimeStep

writeControl    adjustableRunTime;

writeInterval   0.01;      // write every 10 ms (50 frames total)

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.5;       // Courant number limit

maxDeltaT       0.005;     // never exceed initial dt


libs
(
    "libsixDoFRigidBodyMotion.so"
    "libsixDoFRigidBodyState.so"
    "libfvMotionSolvers.so"
    "libfallingInletVelocity.so"
);

functions
{
}

// ************************************************************************* //