tutorials/RFGTumble2D/combiRun/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

// Patches to create.
patches
(
    {
        name            master;
        patchInfo
        {
            type cyclicAMI;
            matchTolerance 0.0001;
            transform noOrdering;
            neighbourPatch slave;
        }
        constructFrom   patches;
        patches         (master);
    }
    {
        name            slave;
        patchInfo
        {
            type cyclicAMI;
            matchTolerance 0.0001;
            transform noOrdering;
            neighbourPatch master;
        }
        constructFrom   patches;
        patches         (slave);
    }
);


// ************************************************************************* //
