tutorials/RFGTumble2D/combiRun/system/extrudeMeshDict.0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     4.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sourceCase          "./";
sourcePatches       (patch_0_2);
constructFrom       patch;
exposedPatchName    patch_0_2;

flipNormals         true;

extrudeModel        plane;
thickness           1.0;

mergeTol            1e-6;
mergeFaces          false;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
