tutorials/RFGTumble2D/combiRun/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    // Euler is 1st-order but unconditionally stable for 6DoF coupling
    default         Euler;
}

gradSchemes
{
    default             Gauss linear;
    grad(U)             cellLimited Gauss linear 1;
}

divSchemes
{
    default             none;

    // Momentum: linearUpwind for stability with dynamic mesh
    div(phi,U)          Gauss linearUpwind grad(U);

    // Turbulence stress divergence
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default             Gauss linear corrected;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default             corrected;
}

// oversetInterpolation removed — using AMI, not overset

// ************************************************************************* //