tutorials/RFGTumble2D/combiRun/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    // Hydrostatic-reduced kinematic pressure
    p_rgh
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0.05;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
    }

    UFinal
    {
        $U;
        relTol          0;
    }

    // Flux correction after mesh motion (required by correctPhi)
    pcorr
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }

    // Mesh motion (kept in case sixDoFRigidBodyMotion needs it)
    cellDisplacement
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.01;
    }

    cellDisplacementFinal
    {
        $cellDisplacement;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   yes;

    nOuterCorrectors    2;
    nCorrectors         2;
    nNonOrthogonalCorrectors 1;

    correctPhi          yes;
    moveMeshOuterCorrectors yes;
}

relaxationFactors
{
    fields
    {
    }
    equations
    {
        U               1.0;
        UFinal          1.0;
    }
}

// ************************************************************************* //
